# VersionNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..VersionNumber Property
Application Class See Also
---
Return the primary version of the Revit application.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string VersionNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VersionNumber As String
	Get
```

Visual C++
---
```text
public:
property String^ VersionNumber {
	String^ get ();
}
```

# Remarks
This property can be used by your application to find the version of Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Revit.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace